bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA32A4U.xml
            <value-group caption="Brownout Detection Voltage Level" name="BODLVL">
                <value caption="1.6 V" name="1V6" value="0x07"/>
                <value caption="1.8 V" name="1V8" value="0x06"/>
                <value caption="2.0 V" name="2V0" value="0x05"/>
                <value caption="2.2 V" name="2V2" value="0x04"/>
                <value caption="2.4 V" name="2V4" value="0x03"/>
                <value caption="2.6 V" name="2V6" value="0x02"/>
                <value caption="2.8 V" name="2V8" value="0x01"/>
                <value caption="3.0 V" name="3V0" value="0x00"/>
            </value-group>
        </module>
        <module name="LOCKBIT" id="I6570" version="XMEGAA4U" caption="Fuses and Lockbits">
            <register-group caption="Lock Bits" name="NVM_LOCKBITS">
                <register caption="Lock Bits" name="LOCKBITS" offset="0x00" size="1" initval="0xFF">
                    <bitfield caption="Boot Lock Bits - Boot Section" mask="0xC0" name="BLBB" values="FUSE_BLBB"/>
                    <bitfield caption="Boot Lock Bits - Application Section" mask="0x30" name="BLBA" values="FUSE_BLBA"/>
                    <bitfield caption="Boot Lock Bits - Application Table" mask="0x0C" name="BLBAT" values="FUSE_BLBAT"/>
                    <bitfield caption="Lock Bits" mask="0x03" name="LB" values="FUSE_LB"/>
                </register>
            </register-group>
            <value-group caption="Boot lock bits - boot section" name="FUSE_BLBB">
                <value caption="Read and write not allowed" name="RWLOCK" value="0x00"/>
                <value caption="Read not allowed" name="RLOCK" value="0x01"/>
                <value caption="Write not allowed" name="WLOCK" value="0x02"/>
                <value caption="No locks" name="NOLOCK" value="0x03"/>
            </value-group>
            <value-group caption="Boot lock bits - application section" name="FUSE_BLBA">
                <value caption="Read and write not allowed" name="RWLOCK" value="0x00"/>
                <value caption="Read not allowed" name="RLOCK" value="0x01"/>
                <value caption="Write not allowed" name="WLOCK" value="0x02"/>
                <value caption="No locks" name="NOLOCK" value="0x03"/>
            </value-group>
            <value-group caption="Boot lock bits - application table section" name="FUSE_BLBAT">
                <value caption="Read and write not allowed" name="RWLOCK" value="0x00"/>
                <value caption="Read not allowed" name="RLOCK" value="0x01"/>
                <value caption="Write not allowed" name="WLOCK" value="0x02"/>
                <value caption="No locks" name="NOLOCK" value="0x03"/>
            </value-group>
            <value-group caption="Lock bits" name="FUSE_LB">
                <value caption="Read and write not allowed" name="RWLOCK" value="0x00"/>
                <value caption="Write not allowed" name="WLOCK" value="0x02"/>
                <value caption="No locks" name="NOLOCK" value="0x03"/>
            </value-group>
        </module>
        <module name="SIGROW" id="I6570" version="XMEGAAU" caption="Signature Row">
            <register-group caption="Production Signatures" name="NVM_PROD_SIGNATURES" size="72">
                <register caption="RCOSC 2 MHz Calibration Value B" name="RCOSC2M" offset="0x00" size="1"/>
                <register caption="RCOSC 2 MHz Calibration Value A" name="RCOSC2MA" offset="0x01" size="1"/>
                <register caption="RCOSC 32.768 kHz Calibration Value" name="RCOSC32K" offset="0x02" size="1"/>
                <register caption="RCOSC 32 MHz Calibration Value B" name="RCOSC32M" offset="0x03" size="1"/>
                <register caption="RCOSC 32 MHz Calibration Value A" name="RCOSC32MA" offset="0x04" size="1"/>
                <register caption="Lot Number Byte 0, ASCII" name="LOTNUM0" offset="0x08" size="1"/>
                <register caption="Lot Number Byte 1, ASCII" name="LOTNUM1" offset="0x09" size="1"/>
                <register caption="Lot Number Byte 2, ASCII" name="LOTNUM2" offset="0x0A" size="1"/>
                <register caption="Lot Number Byte 3, ASCII" name="LOTNUM3" offset="0x0B" size="1"/>
                <register caption="Lot Number Byte 4, ASCII" name="LOTNUM4" offset="0x0C" size="1"/>
                <register caption="Lot Number Byte 5, ASCII" name="LOTNUM5" offset="0x0D" size="1"/>
                <register caption="Wafer Number" name="WAFNUM" offset="0x10" size="1"/>
                <register caption="Wafer Coordinate X Byte 0" name="COORDX0" offset="0x12" size="1"/>
                <register caption="Wafer Coordinate X Byte 1" name="COORDX1" offset="0x13" size="1"/>
                <register caption="Wafer Coordinate Y Byte 0" name="COORDY0" offset="0x14" size="1"/>
                <register caption="Wafer Coordinate Y Byte 1" name="COORDY1" offset="0x15" size="1"/>
                <register caption="USB Calibration Byte 0" name="USBCAL0" offset="0x1A" size="1"/>
                <register caption="USB Calibration Byte 1" name="USBCAL1" offset="0x1B" size="1"/>
                <register caption="USB RCOSC Calibration Value B" name="USBRCOSC" offset="0x1C" size="1"/>
                <register caption="USB RCOSC Calibration Value A" name="USBRCOSCA" offset="0x1D" size="1"/>
                <register caption="ADCA Calibration Byte 0" name="ADCACAL0" offset="0x20" size="1"/>
                <register caption="ADCA Calibration Byte 1" name="ADCACAL1" offset="0x21" size="1"/>
                <register caption="ADCB Calibration Byte 0" name="ADCBCAL0" offset="0x24" size="1"/>
                <register caption="ADCB Calibration Byte 1" name="ADCBCAL1" offset="0x25" size="1"/>
                <register caption="Temperature Sensor Calibration Byte 0" name="TEMPSENSE0" offset="0x2E" size="1"/>
                <register caption="Temperature Sensor Calibration Byte 1" name="TEMPSENSE1" offset="0x2F" size="1"/>
                <register caption="DACA0 Calibration Byte 0" name="DACA0OFFCAL" offset="0x30" size="1"/>
